{
  "projects": [
    {
      "id": "0",
      "date": "Ene 2020",
      "title": "GitHub Match",
      "subtitle": "Explorador para API GitHub",
      "tags": ["NEXT", "Bulma", "Express", "Axios", "API", "React-Hooks", "Eslint"],
      "overview": "GitHub Match es una app mobile-first que facilita la exploración de la API GitHub para encontrar repositorios y usuarios en GitHub.",
      "description": "Esta aplicación se desarrollo para facilitar la búsqueda y navegación de repositorios y usuarios en GitHub. Consumiendo la API de GitHub implementando solicitudes Axios; añadiendo la configuración necesaria para obtener resultados satisfactorios en todas las auditorías de Lighthouse; con el fin de desarrollar una app mobile first que propocione la mejor experiencia de usuario posible.",
      "learnings": [
        "Primer proyecto implementando servidor Express en configuración para Next.js",
        "Planificación total del proyecto, incluyendo, diseño de flujo de usuario e interfaz intuitiva implementando herramientas SCRUM y Agile.",
        "Se aplicó el concepto de Web App Progresiva para lo cuál se crearon los iconos aplicables a distintos dispositivos (móviles y de escritorio).",
        "Auditorías por parte de Lighthouse con excelentes resultados en rendimiento, accesibilidad y estado progresivo (funcionamiento sin conexión a Internet)."
      ],
      "thumbnail": "GitHub-Match",
      "src": "/assets/github-match.png",
      "type": "Browser for GitHub API ",
      "github": "https://github.com/eriika19/GitHubMatch",
      "demo": "https://git-hub-match.now.sh/",
      "label": ["Ir a repositorio GitHub", "Abrir Demo"]
    },
    {
      "id": "1",
      "date": "Sept 2019",
      "title": "MD-Links",
      "subtitle": "Librería de Node.js (Backend)",
      "tags": ["node.js", "minimist", "request"],
      "overview": "MD-Links es una librería de Node.js que permite al usuario, a partir de una Interfaz de Línea de Comandos (CLI) o la importación de la función MD-Links, buscar y verificar el status de los links existentes dentro de cualquier archivo Markdown (*.md).",
      "description": "MD-Links es una librería de Node.js que permite al usuario, a partir de una Interfaz de Línea de Comandos (CLI) o la importación de la función MD-Links, buscar y verificar el status de los links existentes dentro de cualquier archivo Markdown (*.md) o archivos Markdown dentro de un directorio.",
      "learnings": [
        "Primer proyecto Back-End aplicando conceptos y uso de modularidad dentro de Node.js.",
        "Se trabajó y manejó el concepto de promesas y procesos asíncronos"
      ],
      "thumbnail": "Links",
      "src": "/assets/md_links.jpg",
      "type": "Librería Node.js",
      "github": "https://github.com/eriika19/md-links",
      "demo": "https://github.com/eriika19/md-links#demo",
      "label": ["Ir a repositorio GitHub", "Abrir Demo"]
    },
    {
      "id": "2",
      "date": "Ago 2019",
      "title": "Sacbé",
      "subtitle": "Red Social (JS, Firebase, SPA)",
      "tags": ["spa", "firebase", "crud", "materialize", "here"],
      "overview": "Sacbé es una app mobile-first dirigida a ciclistas que enfrentan la ciudad cada día. Permite a los ciclistas intercambiar información de interés común e incluye funcionalidades de valor como un directorio, mapa con geolocalización y botón S.O.S. para alertar a otros usuarios en caso de peligro.",
      "description": "Sacbé es una web app mobile-first dirigida a ciclistas de la CDMX que se enfrentan a distintos contratiempos y peligros viales. El objetivo es crear una red de que permita a los ciclistas intercambiar información de interés común; además cuenta con funcionalidades de alto valor como un directorio, enfocado a la comunidad, que muestra un mapa con ubicación y un botón S.O.S. que permite compartir su ubicación, a otros usuarios, en caso de un percance.",
      "learnings": [
        "Se trabajó bajo la metodología Agile y SCRUM para la planificación de tareas, sus tiempos y alcanzables de cada Sprint (3 Sprints)",
        "Trabajo colaborativo donde se trabajó en la comunicación eficaz, planificación y toma de decisiones en equipo.",
        "Es una app web SPA creada con modularidad de Javascript.",
        "Se utilizó el servicio de autenticación de Firebase y el servicio de base de datos de Firestore.",
        "Se aplicó el concepto de CRUD dentro del muro de publicaciones dentro de la aplicación.",
        "Se empleo el uso de la librería de estilos Materialize para el desarrollo de la interfaz (UI)."
      ],
      "thumbnail": "Sacbé",
      "src": "/assets/sacbe.png",
      "type": "red social",
      "github": "https://github.com/eriika19/MEX008-social-network",
      "demo": "https://eriika19.github.io/MEX008-social-network/src/",
      "label": ["Ir a repositorio GitHub", "Abrir Demo"]
    },
    {
      "id": "3",
      "date": "Jul 2019",
      "title": "Smart Spend",
      "subtitle": "Aplicación Fintech (JS)",
      "tags": ["javascript", "css", "html", "bootstrap"],
      "overview": "Smart Spend es un aplicación cuya propuesta es impulsar la cultura finaciera aportando tips y noticias al usuario día a día; a través de un simpático personaje.",
      "description": "Smart Spend es un aplicación cuya propuesta es impulsar la cultura finaciera aportando tips y noticias al usuario día a día; a través de un simpático personaje.",
      "learnings": ["Primer Lugar en el Hackatón Fintech - Salud Financiera."],
      "thumbnail": "SmartSpend",
      "src": "/assets/smart_spend.png",
      "type": "fintech app",
      "github": "https://github.com/eriika19/MEX008-hackathon-Interna-SF",
      "demo": "https://eriika19.github.io/MEX008-hackathon-Interna-SF/src/",
      "label": ["Ir a repositorio GitHub", "Abrir Demo"]
    },
    {
      "id": "4",
      "date": "Jul 2019",
      "title": "Steam",
      "subtitle": "Portal de noticias (JS, API)",
      "tags": ["javascript", "css", "html", "api", "bootstrap"],
      "overview": "Steam News es un portal de noticias para Gamers. Una Aplicación Web responsiva que hace uso de la base de datos del portal STEAM, una popular plataforma de distribución de videojuegos.",
      "description": "Steam News es un portal de noticias para Gamers. Una Aplicación Web responsiva que hace uso de la base de datos del portal STEAM, una popular plataforma de distribución de videojuegos.",
      "learnings": [
        "Se aprendió a trabajar bajo la metodología Agile (KANBAN, Sprints y Milestones. Herramienta Trello).",
        "Primer trabajo colaborativo, practicando peer programming y planificando tiempos y tareas de manera colaborativa.",
        "Inicios de trabajo con JS, HTML, CSS y Bootstrap."
      ],
      "thumbnail": "Steam",
      "src": "/assets/steam_desktop.png",
      "type": "news web app",
      "github": "https://github.com/eriika19/MEX-Data-Lovers-008",
      "demo": "https://eriika19.github.io/MEX-Data-Lovers-008/src/",
      "label": ["Ir a repositorio GitHub", "Abrir Demo"]
    },
    {
      "id": "5",
      "date": "Oct 2019",
      "title": "Mesereando",
      "subtitle": "Aplicación progresiva para PYME (React)",
      "tags": ["react", "reactstrap", "react-router"],
      "overview": "Mesereando es una Progressive Web App diseñada para la eficiente gestión y toma de pedidos de una PYME de servicio de comida rápida.",
      "description": "Mesereando es una Progressive Web App diseñada para la gestión y toma de comandas de una PYME de comida rápida utilizando la librería React",
      "learnings": [
        "Primer proyecto de React",
        "Trabajo colaborativo entre equipo UX y FE. Se implementó el uso de herramientas SCRUM y Agile para una efectiva comunicación entre todas las integrantes del equipo con el fin de un toma de decisiones colaborativa que permitió priorizar, planificar, efectuar programación colaborativa, asignación de responsabilidades, testeo de producto y manejo de frustración en equipo.",
        "Se aplicó el concepto de Web App Progresiva para lo cuál se crearon los iconos aplicables a distintos dispositivos (móviles y de escritorio).",
        "Auditorías por parte de Lighthouse con excelentes resultados en rendimiento, accesibilidad y estado progresivo (funcionamiento sin conexión a Internet)."
      ],
      "thumbnail": "Mesereando",
      "src": "/assets/mesereando.png",
      "type": "PWA",
      "github": "https://github.com/eriika19/MEX008-FE-Burger-Queen",
      "demo": "https://eriika19.github.io/MEX008-FE-Burger-Queen",
      "label": ["Ir a repositorio GitHub", "Abrir Demo"]
    },
    {
      "id": "6",
      "date": "May 2020",
      "title": "Wanna-taco",
      "subtitle": "Localizador de restaurantes",
      "tags": ["NEXT", "Bulma", "Express", "Axios", "API", "React-Hooks", "Eslint", "Husky", "Lint-staged", "Leaflet"],
      "overview": "GitHub Match es una web app que facilita la exploración y localización de los mejores restaurantes en la ciudad.",
      "description": "Esta aplicación se desarrollo para brindar información actualizada de los mejores los restaurantes.Facilitando la búsqueda por tipo de comida, orden alfabètico o puntuación. Se consumió una API mediante solicitudes Axios y se construyó un mapa interactivo que muestra la ubicación e información relevante de distintos restaurantes.",
      "learnings": [
        "Planificación total del proyecto, incluyendo, diseño de flujo de usuario e interfaz intuitiva implementando herramientas SCRUM y Agile.",
        "Se realizó configuración para Husky y lint-staged aplicando reglas de estilo de prettier y eslint",
        "Se implementó mapa interactivo con pop up desplegables a partir del consumo de la API"
      ],
      "thumbnail": "Wanna-taco",
      "src": "/assets/wanna-taco.png",
      "type": "Browser for restaurants API and interactive map",
      "github": "https://github.com/eriika19/wanna-taco",
      "demo": "https://wanna-taco.now.sh/",
      "label": ["Ir a repositorio GitHub", "Abrir Demo"]
    }
  ]
}
